package lessons.lesson08.homework

fun main() {
    e1("Это невозможно выполнить за один день")
    e1("Я не уверен в успехе этого проекта")
    e1("Произошла катастрофа на сервере")
    e1("Этот код работает без проблем")
    e1("Удача")
    e2("2021-12-01 09:48:23")
    e3("4539 1488 0343 6467")
    e4("username@example.com")
    e5("C:/Пользователи/Документы/report.txt")
    e6("Котлин лучший язык программирования")
}
// 1. Преобразование строк
// Создайте функцию, которая будет анализировать входящие фразы и применять к ним различные
// преобразования, делая текст более ироничным или забавным. Функция должна уметь распознавать
// ключевые слова или условия и соответственно изменять фразу.
//
//Правила проверки и преобразования:
//Если фраза содержит слово "невозможно":
//Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
//Если фраза начинается с "Я не уверен":
//Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
//Если фраза содержит слово "катастрофа":
//Преобразование: Замените "катастрофа" на "интересное событие".
//Если фраза заканчивается на "без проблем":
//Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
//Если фраза содержит только одно слово:
//Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".
//Примеры Тестовых Фраз:
//"Это невозможно выполнить за один день"
//"Я не уверен в успехе этого проекта"
//"Произошла катастрофа на сервере"
//"Этот код работает без проблем"
//"Удача"
fun e1(arg: String) {
    when {
        arg.contains("невозможно") -> println(
            arg.replace("невозможно", "совершенно точно возможно, просто требует времени"))
        arg.startsWith("Я не уверен") -> println(
            "$arg, но моя интуиция говорит об обратном"
        )
        arg.contains("катастрофа") -> println(
            arg.replace("катастрофа", "интересное событие")
        )
        arg.endsWith("без проблем") -> println(
            arg.replace("без проблем", "с парой интересных вызовов на пути")
        )
        !arg.contains(" ") -> println("Иногда, $arg, но не всегда")
    }
}

//2. Извлечение даты из строки лога
//У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23"
// (данные могут быть любыми, но формат всегда такой). Извлеките отдельно дату и время из этой
// строки и сразу распечатай их по очереди. Используй indexOf или split для получения правой части
// сообщения.
fun e2(arg: String) {
    val datetimeArr = arg.split(" ")
    println(datetimeArr[0])
    println(datetimeArr[1])
}
//3. Маскирование личных данных
//Дана строка с номером кредитной карты, например "4539 1488 0343 6467". Замаскируйте все цифры,
// кроме последних четырех, символами "*".
fun e3(arg: String) {
    val revealedChars = arg.substring(15, 19)
    println("**** **** **** $revealedChars")
}
//4. Форматирование адреса электронной почты.
//У вас есть электронный адрес, например "username@example.com". Преобразуйте его в строку
// "username [at] example [dot] com", используя функцию replace()
fun e4(arg: String) {
    println(arg.replace("@", " [at] ").replace(".", " [dot] "))
}
//5. Извлечение имени файла из пути.
//Дан путь к файлу, например "C:/Пользователи/Документы/report.txt" или "D:/good.themes/dracula.theme"
// (может быть любым). Извлеките название файла с расширением.
fun e5(arg: String) {
    val arr = arg.split("/")
    println(arr.last())
}
//6. Создание аббревиатуры из фразы.
//У вас есть фраза, например "Котлин лучший язык программирования" (может быть любой с разделителями
// слов - пробел). Создайте аббревиатуру из начальных букв слов (например, "ООП").
//Используйте split. Используйте for для перебора слов. Используйте var переменную для накопления
// первых букв.
fun e6(arg: String) {
    val arr = arg.split(" ")
    var firstLetters = ""
    for (word in arr) {
        firstLetters += word[0].uppercase()
    }
    println(firstLetters)
}
