package lessons.lesson12.homework

fun main() {
    // Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод,
    // не повторяйся. Список методов в рекомендациях под заданиями.
    //Задачи на приведение коллекции к значению
    val e1 = listOf(1, 2, 3, -4, 5, 6)
    //Проверить, что размер коллекции больше 5 элементов.
    println(e1.size > 5)
    //Проверить, что коллекция пустая
    println(e1.isEmpty())
    //Проверить, что коллекция не пустая
    println(e1.isNotEmpty())
    //Взять элемент по индексу или создать значение если индекса не существует
    println(e1.getOrElse(8) { 0 })
    //Собрать коллекцию в строку
    println(e1.joinToString("*"))
    //Посчитать сумму всех значений
    println(e1.sum())
    //Посчитать среднее
    println(e1.average())
    //Взять максимальное число
    println(e1.maxOrNull())
    //Взять минимальное число
    println(e1.minOrNull())
    //Взять первое число или null
    println(e1.firstOrNull())
    //Проверить что коллекция содержит элемент
    println(e1.contains(20))

    //Задачи на обработку коллекций
    val e2 = listOf(-1, 20, 3, -4, 5, 6, 30)
    //Отфильтровать коллекцию по диапазону 18-30
    println(e2.filter { it in 18..30 })
    //Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(e2.filter { it % 2 != 0 && it % 3 != 0 })
    //Очистить текстовую коллекцию от null элементов
    val e3 = listOf(null, "test", "test1")
    println(e3.filter { it != null })
    //Преобразовать текстовую коллекцию в коллекцию длин слов
    println(e3.map { it?.length })
    //Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    val e4 = listOf("abc", "defg", "qwerty")
    println(e4.associate { it.reversed() to it.length })
    //Отсортировать список в алфавитном порядке
    println(e4.sorted())
    //Взять первые 3 элемента списка
    println(e2.take(3))
    //Распечатать квадраты элементов списка
    println(e2.forEach() { it * it })
    //Группировать список по первой букве слов
    println(e4.groupBy { it[0] })
    //Очистить список от дублей
    println(e2.distinct())
    //Отсортировать список по убыванию
    println(e4.sortedDescending())
    //Взять последние 3 элемента списка
    println(e2.takeLast(3))

    collectionFeature(listOf())
    collectionFeature(listOf(2, 2))
    collectionFeature(listOf(0, 2, 3, 4, 5))
    collectionFeature(listOf(10000, 2, 3, 4, 5))
    collectionFeature(listOf(5, 15, 10, 10, 10))
    collectionFeature(listOf(-5000000, 15, -4000000, 4, 5))
    collectionFeature(listOf(-200, -20, -30, -40, -50))
    collectionFeature(listOf(2000, 1001, 1003, 1002, 1001))
    collectionFeature(listOf(3, 14, 15, 4, 5, 6))

    println(filterGrades(listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)))

    val exList = listOf(
        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка",
        "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик",
        "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска",
        "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба",
        "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья",
        "посуда", "Настольная лампа", "торшер", "Этажерка"
    )
    println(mapCatalogue(exList))
    println(avgWordLength(exList))

    val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
    println(numCategories(numbers))

    val ages = listOf(22, 18, 30, 45, 17, null, 60)
    println(firstMatch(ages, 18))
}

//Реши задачи ниже в отдельных функциях.
//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой
// коллекции используя конструкцию when
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток
fun collectionFeature(arg: List<Int>): String {
    var value = "Уникальная"
    when {
        arg.isEmpty() -> value = "Пусто"
        arg.size < 5 -> value = "Короткая"
        arg.elementAt(0) == 0 -> value = "Стартовая"
        arg.sum() > 10000 -> value = "Массивная"
        arg.average() == 10.0 -> value = "Сбалансированная"
        arg.joinToString("").length == 20 -> value = "Клейкая"
        arg.max() < -10 -> value = "Отрицательная"
        arg.min() > 1000 -> value = "Положительная"
        arg.contains(3) && arg.contains(14) -> value = "Пи***тая"
    }
    println(value)
    return value
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию
// и взять первые 3. Вызывай методы обработки и фильтрации последовательно один из другого,
// чтобы результат предыдущего метода являлся основой для следующего.
fun filterGrades(arg: List<Int>): List<Int> {
    return arg.filter { it >= 60 }
        .sorted()
        .take(3)
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой
// и значением - списком строк.
//Начальные значения: val list = listOf(
//"Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка",
// "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик",
// "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска",
// "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба",
// "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья",
// "посуда", "Настольная лампа", "торшер", "Этажерка")
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой
// букве используя метод groupBy
fun mapCatalogue(arg: List<String>): Map<String, List<String>> {
    return arg.groupBy { it[0].lowercase() }.toSortedMap()
}

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный
// текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
fun avgWordLength(arg: List<String>): String {
    val lengths = arg.map { it.length }
    return "%.2f".format(lengths.average())
}

//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и
// значениями - список чисел.
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности
// (“четные” и “нечетные”).
fun numCategories(arg: List<Int>): Map<String, List<Int>> {
    return arg.distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста,
// например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и
// вернуть его, либо null если значения не нашлось.
fun firstMatch(arg1: List<Int?>, arg2: Int): Int? {
    return arg1.firstOrNull { it!! > arg2 }
}
