package lessons.lesson10.homework

fun main() {
    // Задачи на работу со словарём
    //Создайте пустой неизменяемый словарь, где ключи и значения - целые числа.
    val e1 = mapOf<Int, Int>()

    //Создайте словарь, инициализированный несколькими парами "ключ-значение", где ключи - float, а значения - double
    val e2 = mapOf(1.1 to 1.22, 2.0 to 999.999)

    //Создайте изменяемый словарь, где ключи - целые числа, а значения - строки.
    val e3 = mutableMapOf<Int, String>()

    //Имея изменяемый словарь, добавьте в него новые пары "ключ-значение".
    val e4 = mutableMapOf("a" to 1)
    e4["b"] = 11

    //Используя словарь из предыдущего задания, извлеките значение, используя ключ. Попробуй получить значение с ключом, которого в словаре нет.
    println(e4["b"])
    println(e4["c"]) // null

    //Удалите определенный элемент из изменяемого словаря по его ключу.
    e4.remove("a")
    println(e4)

    //Создайте словарь (ключи Double, значения Int) и выведи в цикле результат деления ключа на значение. Не забудь обработать деление на 0 (в этом случае выведи слово “бесконечность”)
    val e7 = mapOf(1.1 to 10, 2.2 to 100, 3.33 to 0)
    for ((k, v) in e7) {
        if (v == 0) {
            println("бесконечность")
        }
        else {
            println(k / v)
        }
    }

    //Измените значение для существующего ключа в изменяемом словаре.
    e4["b"] = 111
    println(e4)

    //Создайте два словаря и объедините их в третьем изменяемом словаре через циклы.
    val e9v1 = mapOf("a" to "AAA")
    val e9v2 = mapOf("1" to "BBB", "a" to 2)
    val e9v3 = mutableMapOf<String, Any>()

    for ((k, v) in e9v1) {
        e9v3[k] = v
    }
    for ((k, v) in e9v2) {
        if (k !in e9v3) {
            e9v3[k] = v
        }
    }
    println(e9v3)

    //Создайте словарь, где ключами являются строки, а значениями - списки целых чисел. Добавьте несколько элементов в этот словарь.
    val e10 = mutableMapOf<String, List<Int>>()
    e10["a"] = listOf(1, 1)
    e10["b"] = listOf(10, 11)
    println(e10)

    //Создай словарь, в котором ключи - это целые числа, а значения - изменяемые множества строк.
    // Добавь данные в словарь. Получи значение по ключу (это должно быть множество строк) и добавь в это множество ещё строку.
    // Распечатай полученное множество.
    val e11 = mutableMapOf<Int, MutableSet<String>>()
    e11[1] = mutableSetOf("kdsckm", "pfdckm")
    e11[1]?.add("new")
    println(e11[1])

    //Создай словарь, где ключами будут пары чисел. Через перебор найди значение у которого пара будет
    // содержать цифру 5 в качестве первого или второго значения.
    val e12 = mapOf((1 to 11) to "a", (5 to 55) to "b", (6 to 5) to "c")
    println(e12)
    for ((k, v) in e12) {
        val (a, b) = k
        if (a == 5 || b == 5) {
            println(v)
        }
    }

    //Задачи на подбор оптимального типа для словаря
    //Словарь библиотека: Ключи - автор книги, значения - список книг
    val m1: MutableMap<String, List<String>>

    //Справочник растений: Ключи - типы растений (например, "Цветы", "Деревья"), значения - списки названий растений
    val m2: MutableMap<String, List<String>>

    //Четвертьфинала: Ключи - названия спортивных команд, значения - списки игроков каждой команды
    val m3: MutableMap<String, List<String>>

    //Курс лечения: Ключи - даты, значения - список препаратов принимаемых в дату
    val m4: MutableMap<String, List<String>>

    //Словарь путешественника: Ключи - страны, значения - словари из городов со списком интересных мест.
    val m5: MutableMap<String, MutableMap<String, List<String>>>
}