package lessons.lesson13.homework

fun main() {
    // Для решения каждой задачи постарайтесь использовать наиболее подходящий метод, не повторяясь с решением других задач.
    // Дан словарь с именем и временем выполнения каждого автоматизированного теста в секундах.
    // Определите среднее время выполнения теста.
    val e1 = mapOf<String, Double>("test1" to 1.5, "test2" to 0.8, "test3" to 0.5)
    println(e1.values.average())
//Имеется словарь с метаданными автоматизированных тестов, где ключи — это имена тестовых методов
// а значения - строка с метаданными. Выведите список всех тестовых методов.
    val e2 = mapOf("test1" to "dfckld", "test2" to "kmfdv", "test3" to "ppdk")
    println(e2.keys)
//В изменяемый словарь с данными о прохождении тестов добавьте новый тест и его результат.
    val e3 = mutableMapOf("test1" to "passed", "test4" to "passed", "test2" to "failed")
    e3["test3"] = "skipped"
    println(e3)
//Посчитайте количество успешных тестов в словаре с результатами (ключ - название, значение - результат из passed, failed, skipped).
    println(e3.count { it.value == "passed" })
//Удалите из изменяемого словаря с баг-трекингом запись о баге, который был исправлен
// (ключ - название, значение - статус исправления).
    val e5 = mutableMapOf("bug1" to "fixed", "bug2" to "in progress", "bug3" to "fixed")
    val e5v1 = e5.filterValues { it != "fixed" }
    println(e5v1)
//Для словаря с результатами тестирования веб-страниц (ключ — URL страницы, значение — статус ответа),
// выведите сообщение о странице и статусе её проверки.
    val e6 = mapOf("url1" to "not ok", "url2" to "ok")
    e6.forEach { println("страница: ${it.key}, статус: ${it.value}") }
//Найдите в словаре с названием и временем ответа сервисов только те, время ответа которых превышает заданный порог.
    val e7 = mapOf("service1" to 0.2, "service2" to 0.05, "service3" to 0.05)
    println(e7.filterValues { it > 0.1 })
//В словаре хранятся результаты тестирования API (ключ — endpoint, значение — статус ответа в виде строки).
// Для указанного endpoint найдите статус ответа, если endpoint отсутствует, предположите, что он не был протестирован.
    val e8 = mapOf("GET /user" to "200", "POST /user" to "201")
    println(e8.getOrDefault("PATCH /user", "not tested"))
//Из словаря, содержащего конфигурации тестового окружения (ключ — название параметра конфигурации,
// значение - сама конфигурация), получите значение для "browserType". Ответ не может быть null.
    val e9 = mapOf("param1" to "a", "browserType" to null)
    println(e9.getOrElse("browserType", { "must not be null" }))
//Создайте копию неизменяемого словаря с данными о версиях тестируемого ПО, добавив новую версию.
    val e10 = mapOf("v1" to 100302)
    val e10v1 = e10 + ("v2" to 438230)
    println(e10v1)
//Используя словарь с настройками тестирования для различных мобильных устройств (ключ — модель устройства,
// значение - строка с настройками), получите настройки для конкретной модели или верните настройки по умолчанию.
    val e11 = mapOf("model1" to "setting")
    println(e11.getOrDefault("model1", "x"))
//Проверьте, содержит ли словарь с ошибками тестирования (ключ - код ошибки, значение - описание ошибки)
// определенный код ошибки.
    val e12 = mapOf("401" to "unauth", "404" to "not found")
    println(e12.containsKey("403"))
//Дан неизменяемый словарь, где ключи — это идентификаторы тестовых сценариев в формате "TestID_Version",
// а значения — статусы выполнения этих тестов ("Passed", "Failed", "Skipped"). Отфильтруйте словарь,
// оставив только те сценарии, идентификаторы которых соответствуют определённой версии тестов, то-есть
// в ключе содержится требуемая версия.
    val e13 = mapOf("TestID1_1" to "Passed", "TestID2_1" to "Failed", "TestID3_2" to "Skipped")
    println(e13.filterKeys { it.endsWith("_1")})
//У вас есть словарь, где ключи — это названия функциональных модулей приложения, а значения — результаты
// их тестирования. Проверьте, есть ли модули с неудачным тестированием.
    val e14 = mapOf("module1" to "passed", "module2" to "failed")
    println(e14.containsValue("failed"))
//Добавьте в изменяемый словарь с настройками тестовой среды настройки из другого словаря.
    val e15 = mutableMapOf("setting1" to "abc")
    val e15v1 = mapOf("setting2" to "cde")
    for (e in e15v1.entries) {
        e15.putIfAbsent(e.key, e.value)
    }
    //Объедините два неизменяемых словаря с данными о багах.
    val e16 = mutableMapOf<String, String>()
    e16.putAll(e14)
    e16.putAll(e13)
    println(e16)
    //Очистите изменяемый словарь с временными данными о последнем прогоне автоматизированных тестов.
    val e17 = mutableMapOf("t1" to "passed", "t2" to "failed")
    e17.clear()
    //Исключите из отчета по автоматизированному тестированию те случаи, где тесты были пропущены
// (имеют статус “skipped”). Ключи - название теста, значения - статус.
    val e18 = mapOf("t1" to "passed", "t2" to "failed")
    println(e18.filterValues { it !=  "skipped"})
    //Создайте копию словаря с конфигурациями тестирования удалив из него несколько конфигураций.
    //val e19 = e15.filterValues { it == "v1" }
    val e19 = e15 - listOf("setting1")
    println(e19)
    //Создайте отчет о тестировании, преобразовав словарь с результатами тестирования (ключ — идентификатор
// теста, значение — результат) в список строк формата "Test ID: результат".
    val e20 = mapOf("T1" to "passed", "T2" to "failed", "T3" to "skipped")
    val e20v1 = e20.map { (id, result) -> "Test ID: $id, $result" }
    println(e20v1)
    //Преобразуйте изменяемый словарь с результатами последнего тестирования в неизменяемый для архивации.
    val e21 = mutableMapOf("T1" to "passed", "T2" to "failed")
    val e21v1 = e21.toMap()
    println(e21v1)
    //Преобразуйте словарь, содержащий числовой ID теста и данные о времени выполнения тестов, заменив
// идентификаторы тестов на их строковый аналог (например через toString()).
    val e22 = mapOf(1 to 1.2, 2 to 0.9, 3 to 2.5)
    val e22v1 = e22.mapKeys { (id, _) -> id.toString() }
    println(e22v1)
    //Для словаря с оценками производительности различных версий приложения (ключи - строковая версия,
// значения - дробное число времени ответа сервера) увеличьте каждую оценку на 10%, чтобы учесть новые условия тестирования.
    val e23 = mapOf("1.0" to 100.0, "1.1" to 120.0, "2.0" to 90.0)
    val e23v1 = e23.mapValues { (_, v) -> v * 1.1 }
    println(e23v1)
    //Проверьте, пуст ли словарь с ошибками компиляции тестов.
    val e24 = mapOf<String, String>()
    println(e24.isEmpty())
    //Убедитесь, что словарь с результатами нагрузочного тестирования не пуст.
    val e25 = mapOf("rps" to 1000, "errors" to 0)
    println(e25.isNotEmpty())
    //Проверьте, прошли ли успешно все автоматизированные тесты в словаре с результатами.
    val e26 = mapOf("t1" to "passed", "t2" to "passed")
    println(e26.all { it.value == "passed" })
    //Определите, содержит ли словарь с результатами тестирования хотя бы один тест с ошибкой.
    println(e26.any { it.value == "failed" })
//Отфильтруйте словарь с результатами тестирования сервисов, оставив только те тесты, которые не прошли
// успешно и содержат в названии “optional”.
    val e28 = e26.filter { (name, status) ->
        status != "passed" && name.contains("optional")
    }
    println(e28)
}
